etc/UPnP_etc2.py

import requests
 
login_url=''
xml="""<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<SOAP-ENV:Body>
    <m:AddPortMapping xmlns:m="urn:schemas-upnp-org:service:WANIPConnection:1">
<NewPortMappingDescription></NewPortMappingDescription><NewLeaseDuration></NewLeaseDuration><NewInternalClient></NewInternalClient><NewEnabled></NewEnabled><NewExternalPort></NewExternalPort><NewRemoteHost></NewRemoteHost><NewProtocol></NewProtocol><NewInternalPort></NewInternalPort>
    </m:AddPortMapping>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>"""
header={'SOAPAction':'\"urn:schemas-upnp-org:service:WANIPConnection:1#AddPortMapping\"'}
resp=requests.post(login_url,headers=header,data=xml)
